using System;
using System.Windows.Forms;

namespace Minesweeper2
{
    public partial class GameRules : Form
    {
        public GameRules()
        {
            InitializeComponent();
        }

        private void GameRules_Load(object sender, EventArgs e)
        {
            this.Icon = Properties.Resources.bomb;

            tbRules.Text = "Целта на играта е да се разкрият всички квадратчета, " +
             "които не съдържат мини/бомби (с левия бутон на мишката), без да попаднем върху мина/бомба преди това. " +
            "Маркиране на мина/бомба става с натискане на десния бутон на мишката (появява се флаг, " +
             "с който обозначаваме предполагаемо място с бомба). "+ "При кликване (с левия бутон), ако в квадратчето няма бомба, " +
             "се изписва броят мини/бомби, съседни на натиснатото квадратче. "+"При избиране на квадратче, което има 0 съседни мини/бомби, " +
             "се разкриват и всички съседни на текущото - те или са квадратчета със съседи мини/бомби (тогава се изписва броят на съседните мини/бомби), или " +
             "са отново квадратчета с 0 съседни мини/бомби (във втория случай се разкриват и техните съседи). "+
             "При кликване (с левия бутон на мишката) на кваратче, съдържащо бомба - играта приключва.";

        }
    }
}
